tests/performance/performance-test.yml
config:
  target: "http://172.17.0.1:3000" #도커 컨테이너 내부 서버
  phases:
    - duration: 3
      arrivalRate: 12345

scenarios:
  - flow:
    - get:
        url: "/api/users"
    - post:
        url: "/api/users"
        json:
          name: "tester"
          email: "tester@example.com"